{
    "Currently the best way to search for packages available from the official Meteor package server is <a href=\"https://atmospherejs.com/?__hstc=256467284.43066bb3ba9519f69b556b6e718ba6b1.1447860264988.1447860264988.1447860264988.1&amp;__hssc=256467284.1.1447860264988&amp;__hsfp=1614345591\">Atmosphere</a>, the community package search website maintained by Percolate Studio. You can also search for packages directly using the <code>meteor search</code> command.": "利用可能なパッケージを探すには、Meteor公式のパッケージサーバーの<a href=\"https://atmospherejs.com/?__hstc=256467284.43066bb3ba9519f69b556b6e718ba6b1.1447860264988.1447860264988.1447860264988.1&amp;__hssc=256467284.1.1447860264988&amp;__hsfp=1614345591\">Atmosphere</a>をご利用ください。また、<code>meteor search</code>コマンドでも探すことができます。",
    "Packages that have a <code>:</code> in the name, such as <code>mquandalle:jade</code>, are written and maintained by community members. The prefix before the colon is the name of the user or organization who created that package. Unprefixed packages are maintained by Meteor Development Group as part of the Meteor framework.": "パッケージ名はコロン区切りで記載され、コロンの前はパッケージを作成したユーザーです。記載のないものはMeteor Development Groupによりメンテナンスされています。",
    "There are currently over 2000 packages available on Atmosphere. Below is a small selection of some of the most useful packages.": "現在Atmosphereには2000以上のパッケージが存在します。あなたにあったものが見つかるでしょう。",
    "This is a drop-in user interface to Meteor&apos;s accounts system. After adding the package, include it in your templates with <code>{{&gt; loginButtons}}</code>. The UI automatically adapts to include controls for any added login services, such as <code>accounts-password</code>, <code>accounts-facebook</code>, etc.": "accounts-uiはMeteor上のアカウントシステムです。パッケージを追加したあと、テンプレートに<code>{{> loginButtons}}</code>を追加します。accounts-uiはソーシャルログインやログインのための機能を自動的に追加することができます。",
    "<a href=\"#/basic/accounts\">See the docs about accounts-ui above.</a>.": "<a href=\"#/basic/accounts\">accounts-uiについてのドキュメントを御覧ください。</a>",
    "Use <a href=\"http://coffeescript.org/\">CoffeeScript</a> in your app. With this package, any files with a <code>.coffee</code> extension will be compiled to JavaScript by Meteor&apos;s build system.": "coffeescriptをMeteorで利用するには<a href=\"http://coffeescript.org/\">Coffeescriptパッケージ</a>を追加してください。.coffeeの拡張子を持つファイルがJavaScriptにコンパイルされるようになります。",
    "Send emails from your app. See the <a href=\"#/full/email\">email section of the full API docs</a>.": "emailを送信するには、<a href=\"#/full/email\">Full APIのメール送信の章を御覧ください。</a>",
    "Use the <a href=\"http://jade-lang.com/\">Jade</a> templating language in your app. After adding this package, any files with a <code>.jade</code> extension will be compiled into Meteor templates. See the <a href=\"https://atmospherejs.com/mquandalle/jade?__hstc=256467284.43066bb3ba9519f69b556b6e718ba6b1.1447860264988.1447860264988.1447860264988.1&amp;__hssc=256467284.1.1447860264988&amp;__hsfp=1614345591\">page on Atmosphere</a> for details.": "<a href=\"http://jade-lang.com/\">Jade</a>を利用するには、<a href=\"https://atmospherejs.com/mquandalle/jade?__hstc=256467284.43066bb3ba9519f69b556b6e718ba6b1.1447860264988.1447860264988.1447860264988.1&amp;__hssc=256467284.1.1447860264988&amp;__hsfp=1614345591\">mquandalle:jade</a>パッケージを追加してください。.jadeファイルがMeteorテンプレートにコンパイルされます。詳細は<a href=\"https://atmospherejs.com/mquandalle/jade?__hstc=256467284.43066bb3ba9519f69b556b6e718ba6b1.1447860264988.1447860264988.1447860264988.1&amp;__hssc=256467284.1.1447860264988&amp;__hsfp=1614345591\">Atmosphere</a>を御覧ください。",
    "JQuery makes HTML traversal and manipulation, event handling, and animation easy with a simple API that works across most browsers.": "JQueryはシンプルなAPIで簡単にDOM操作が可能にします。",
    "JQuery is automatically included in every Meteor app since the framework uses it extensively. See the <a href=\"http://jquery.com/\">JQuery docs</a> for more details.": "JQueryは自動的にMeteorアプリに含まれています。詳細は<a href=\"http://jquery.com/\">JQueryのドキュメント</a>を御覧ください。",
    "This package allows you to make HTTP requests from the client or server using the same API. See the <a href=\"#/full/http\">http docs</a> to see how to use it.": "このパッケージを利用すると、クライアントまたはサーバーからのHTTPリクエストが可能になります。詳細は<a href=\"#/full/http\">httpのドキュメント</a>を御覧ください。",
    "Add the <a href=\"http://lesscss.org/\">LESS</a> CSS preprocessor to your app to compile any files with a <code>.less</code> extension into standard CSS. If you want to use <code>@import</code> to include other files and not have Meteor automatically compile them, use the <code>.import.less</code> extension.": ".less拡張子を持つファイルをコンパイルするために、CSSプリプロセッサの<a href=\"http://lesscss.org/\">LESS</a>を追加します。Meteorがコンパイルしてもいいファイルには<code>@import</code>を、コンパイルしないファイルには<code>.import.less</code>を使用してください。",
    "Include <a href=\"http://daringfireball.net/projects/markdown/syntax\">Markdown</a> code in your templates. It&apos;s as easy as using the <code>{{# markdown}}</code> helper:": "<a href=\"http://daringfireball.net/projects/markdown/syntax\">Markdown</a>を使用する場合は、<code>{{# markdown}}</code>をご使用ください。",
    "Just make sure to keep your markdown unindented, since whitespace matters.": "Markdownはインデントしないように注意してください。",
    "<a href=\"http://underscorejs.org/\">Underscore</a> provides a collection of useful functions to manipulate arrays, objects, and functions. <code>underscore</code> is included in every Meteor app because the framework itself uses it extensively.": "<a href=\"http://underscorejs.org/\">Underscore</a>は、配列、オブジェクト、functionを操作するためのコレクションを提供します。MeteorはUnderscoreを利用しているため、Meteorには既にincludeされています。",
    "This package gives your app server-side rendering to allow search engine crawlers and other bots see your app&apos;s contents. If you care about SEO, you should add this package.": "このパッケージは、検索エンジンのクローラや他のボットがアプリの内容を参照できるように、アプリケーションのサーバー側のレンダリングを提供します。SEO施策を行う際は、このパッケージをご利用ください。",
    "Congratulations, you&apos;re at the end of the Meteor basic documentation. For more advanced features and more specific explanations, check out the <a href=\"#/full/\">Full API Docs</a>.": "MeteorのBasicドキュメントは終了です。より詳しい説明は、<a href=\"#/full/\">Full API Docs</a>を御覧ください。"
}
