{
	"All files inside a top-level directory called <code>public</code> are served as-is to the client. When referencing these assets, do not include <code>public/</code> in the URL, write the URL as if they were all in the top level. For example, reference <code>public/bg.png</code> as <code>&lt;img src=&apos;/bg.png&apos; /&gt;</code>. This is the best place for <code>favicon.ico</code>, <code>robots.txt</code>, and similar files.":"<code>public</code>というディレクトリ名のトップレベルディレクトリの中にあるファイルは、クライアント側にあるかのように扱われます。それらのassetsを参照する場合は、URLに<code>public</code>含めないでください。すべてのファイルがトップレベルにあるものとして書きます。例えば、<code>public/bg.png</code>は<code>&lt;img src=&apos;/bg.png&apos; /&gt;</code>のように書きます。<code>favicon.ico</code> や<code>robots.txt</code>はここに置くのがよいでしょう。","All files inside a top-level directory called <code>private</code> are only accessible from server code and can be loaded via the <a href=\"#assets\"><code>Assets</code></a> API. This can be used for private data files and any files that are in your project directory that you don&apos;t want to be accessible from the outside.":" <code>private</code>というディレクトリ名のトップレベルディレクトリは、サーバーからのみアクセスすることができ、<a href=\"#assets\"><code>Assets</code></a> APIを通してロードできます。プライベートなデータファイルや外部からアクセスされたくないファイルの置き場所として使えます。",
	"This folder is for compatibility JavaScript libraries that rely on variables declared with var at the top level being exported as globals.  Files in this directory are executed without being wrapped in a new variable scope.  These files are executed before other client-side JavaScript files.":"このフォルダーは互換性のあるJavaScriptライブラリーのファイルのためであり、global変数としてトップレベルでvar宣言している変数を信頼しています。この中のファイルは新しい変数スコープでラップされるることなく実行されます。また、ここにあるファイルは他のクライアント・サイトのJavascriptファイルより以前に実行されます。","Any directory named <code>tests</code> is not loaded anywhere. Use this for any local test code.":"<code>tests</code>という名前のディレクトリはロードされません。ローカル環境のテストコードとして使われます。","For compatibility with node.js tools used alongside Meteor, any directory named <code>node_modules</code> is not loaded anywhere. node.js packages installed into <code>node_modules</code> directories will not be available to your Meteor code. Use <code>Npm.depends</code> in your package <code>package.js</code> file for that.":"Meteorと共に使われるnode.jsツールとの互換性のため、<code>node_modules</code>というディレクトリはどこにもロードされません。<code>node_modules</code>ディレクトリにインストールされたnode.jsパッケージはMeteorのコードからは直接使用できません。<code>package.js</code>のファイルの中で<code>Npm.depends</code>を使用してください。","The following directories are also not loaded as part of your app code:":"以下のディレクトリもアプリケーションのコードとしてロードされません。"
}
