{
  "Meteor has a simple dependency tracking system which allows it to automatically rerun templates and other functions whenever <a href=\"#session\"><code>Session</code></a> variables, database queries, and other data sources change.":"Meteorはシンプルな依存関係のトラッキングシステムをもっており、<a href=\"#session\"><code>Session</code></a>変数やデータベースクエリ、その他データソースを変更を検知して、自動的にテンプレートを再描画したり関数を再実行します。",
  "Unlike most other systems, you don&apos;t have to manually declare these dependencies &#x2014; it &quot;just works.&quot; The mechanism is simple and efficient. Once you&apos;ve initialized a computation with <code>Tracker.autorun</code>, whenever you call a Meteor function that returns data, <code>Tracker</code> automatically records which data were accessed. Later, when this data changes, the computation is rerun automatically. This is how a template knows how to re-render whenever its <a href=\"#template_helpers\">helper functions</a> have new data to return.":"他のほとんどのシステムとは異なり、手動でこれらの依存関係を宣言する必要はありません。特に何もしなくても動きます。そのメカニズムはシンプルかつ効率的です。<code>Tracker.autorun</code>で処理を初期化すると、データを返すMeteor関数を呼び出した場合に、どのデータにアクセスしたかが自動で記録されます。その後、そのデータが変更されると、処理が自動的に再実行されます。このようにして、<a href=\"#template_helpers\">ヘルパー関数</a>が新しいデータを返すとテンプレートは再レンダリングが必要なことを検知できます。",
  "Run a function now and rerun it later whenever its dependencies change. Returns a Computation object that can be used to stop or observe the rerunning.":"関数を直ちに実行し、また依存関係にあるものが変更されるたびに、後でそれを実行します。停止または再実行を観察するために使用することができる演算オブジェクトを返します。",
  "The function to run. It receives one argument: the Computation object that will be returned.":"実行する関数。1つの引数を取る: 演算オブジェクトを返します。",
  "Optional. The function to run when an error happens in the Computation. The only argument it recieves is the Error thrown. Defaults to the error being logged to the console.":"オプション。runFuncでエラーが発生した時にこの関数を実行します。この関数は1つの引数を取り、発生したエラーを受け取ります。省略した場合、デフォルトではコンソールにエラーを出力します。",
  "<code>Tracker.autorun</code> allows you to run a function that depends on reactive data sources. Whenever those data sources are updated with new data, the function will be rerun.":"<code>Tracker.autorun</code>はリアクティブデータソースに依存した関数を実行できるようにします。これらのデータソースが新しいデータで更新されるたびに、その関数は再実行されます。",
  "For example, you can monitor one <code>Session</code> variable and set another:":"例えば、1つの<code>Session</code>変数を監視し、それを別のものにセットすることができます:",
  "Or you can wait for a session variable to have a certain value, and do something the first time it does. If you want to prevent further rerunning of the function, you can call <code>stop</code> on the computation object that is passed as the first parameter to the callback function:":"また、Session変数が特定の値になった時に初めて処理を実行するようにもできます。もし、これ以上関数を再実行させたくなければ、コールバック関数の第１引数に渡される演算オブジェクトの<code>stop</code>を呼び出すことで、再実行しないようにできます。",
  "The first time <code>Tracker.autorun</code> is called, the callback function is invoked immediately, at which point it alerts and stops right away if <code>counter === 2</code> already. In this example, <code>Session.get(&quot;counter&quot;) === 0</code> when <code>Tracker.autorun</code> is called, so nothing happens the first time, and the function is run again each time <code>counter</code> changes, until <code>computation.stop()</code> is called after <code>counter</code> reaches <code>2</code>.":"初めて<code>Tracker.autorun</code>が呼ばれると、コールバック関数はすぐに実行され、もしすでに <code>counter === 2</code> の場合は、アラートを表示してすぐに停止します。上の例では、<code>Tracker.autorun</code>が呼ばれた時は <code>Session.get(&quot;counter&quot;) === 0</code> なので、初めは何も起きません。そして、<code>counter</code>が<code>2</code>になり<code>computation.stop()</code>が呼ばれるまでは、<code>counter</code>が変更されるたびに関数が実行されます。",
  "If the initial run of an autorun throws an exception, the computation is automatically stopped and won&apos;t be rerun.":"もし、autorunの初期実行で例外が発生すると、自動的に処理は停止し、再実行されることはありません。",
  "To learn more about how <code>Tracker</code> works and to explore advanced ways to use it, visit the <a href=\"http://manual.meteor.com/#tracker\">Tracker</a> chapter in the <a href=\"http://manual.meteor.com/\">Meteor Manual</a>, which describes it in much more detail.":"<code>Tracker</code>の動きについてもっと学習したり、高度な使い方を知りたい場合は、<a href=\"http://manual.meteor.com/\">Meteor Manual</a>の<a href=\"http://manual.meteor.com/#tracker\">Tracker</a>チャプターにより詳細な説明があります。"
}