{
"There are about a dozen core Meteor packages that most any app will use. Two examples: <a href=\"#webapp\"><code>webapp</code></a>, which handles incoming HTTP connections, and <code>templating</code>, which lets you make HTML templates that automatically update live as data changes. Then there are optional packages like <code>email</code>, which lets your app send emails, or the Meteor Accounts series (<code>accounts-password</code>, <code>accounts-facebook</code>, <code>accounts-ui</code>, and others) which provide a full-featured user account system that you can drop right into your app. In addition to these &quot;core&quot; packages, there are thousands of community-written packages in <a href=\"https://atmospherejs.com/?__hstc=256467284.eff58f8bcd24d01de0c0c49f3422de0d.1445924524567.1445924524567.1445924524567.1&amp;__hssc=256467284.1.1445924524568&amp;__hsfp=1614345591\">Atmosphere</a>, one of which might do just what you need.": "すでにどんなアプリでも使われるような、たくさんのMeteorパッケージがあります。2つの例：<a href=\"#webapp\"><code>webapp</code></a>（これはHTTP接続を処理するものです。)また、<code>templating</code>(これはHTMLテンプレートがデータの変化にしたがって自動的に更新されるパッケージです）。<code>accounts-facebook</code>, <code>accounts-ui</code>,そして他にも全般に渡るユーザーアカウントシステムを即座にアプリに構築できます。これらのコア・パッケージに加えて、何千もの、コミュニティによって書かれたパッケージがあります。<a href = \"https://atmospherejs.com/?__hstc=256467284.eff58f8bcd24d01de0c0c49f3422de0d.1445924524567.1445924524567.1445924524567.1&amp;__hssc=256467284.1.1445924524568&amp;__hsfp=1614345591\"> Atmosphere </a>, あなたのほしいパッケージはこの中にきっとあることでしょう。",
"<code>meteor</code> is a build tool analogous to <code>make</code>, <code>rake</code>, or the non-visual parts of Visual Studio. It gathers up all of the source files and assets in your application, carries out any necessary build steps (such as compiling <a href=\"http://coffeescript.org\">CoffeeScript</a>, minifying CSS, building <a href=\"https://npmjs.org/\">npm</a> modules, or generating source maps), fetches the packages used by your app, and outputs a standalone, ready-to-run application bundle. In development mode it can do all of this interactively, so that whenever you change a file you immediately see the changes in your browser. It&apos;s super easy to use out of the box, but it&apos;s also extensible: you can add support for new languages and compilers by adding build plugin packages to your app.":"<code>meteor</code>は<code>make</code>,<code>rake</code>に似たビルドツールです。それかまた、GUIの無いVisual Studioです。<code>meteor</code>はアプリケーション内のソースファイルとアセットをまとめあげ、必要とされるビルドを行います（<a href=\"http://coffeescript.org\">CoffeeScript</a>のコンパイル , minifying CSS, npm module の構築 <a href=\"https://npmjs.org/\">npm</a> ,またsource mapの生成などです。)"
}
