{
    "Get help on <code>meteor</code> command line usage. Running <code>meteor help</code> by itself will list the common <code>meteor</code> commands. Running <code>meteor help &lt;command&gt;</code> will print detailed help about <code>meteor &lt;command&gt;</code>.": "<code>meteor</code>コマンドラインツールのヘルプを見ます。<code>meteor help</code>を実行するとよく使うコマンドのリストが表示されます。<code>meteor help &lt;command&gt;</code>を実行すると<code>meteor &lt;command&gt;</code>の詳しい使い方が表示されます。",
    "Make a subdirectory called <code>&lt;name&gt;</code> and create a new Meteor app there.": "<code>&lt;name&gt;</code>という名前のディレクトリを作り、そこにMeteorアプリを新しく作ります。",
    "Serve the current app at <a href=\"http://localhost:3000\">http://localhost:3000</a> using Meteor&apos;s local development server.": "アプリを起動し、<a href=\"http://localhost:3000\">http://localhost:3000</a>にローカル開発サーバを用意します。",
    "Run the project with Node Inspector attached, so that you can step through your server code line by line. See <a href=\"#/full/meteordebug\"><code>meteor debug</code></a> in the full docs for more information.": "Nodeインスペクタでアプリを起動します。これにより、サーバサイドのコードをステップ実行できます。詳しくはFull APIのドキュメントを参照してください。",
    "Bundle your app and deploy it to <code>&lt;site&gt;</code>. Meteor provides free hosting if you deploy to <code>&lt;your app&gt;.meteor.com</code> as long as <code>&lt;your app&gt;</code> is a name that has not been claimed by someone else.": "アプリを<code>&lt;site&gt;</code>にデプロイします。<code>&lt;your app&gt;.meteor.com</code>にデプロイした場合、Meteorは無料のホスティングを提供します。ただし、<code>&lt;your app&gt;</code>が既に他に人にとられていない場合です。",
    "Update your Meteor installation to the latest released version and then (if <code>meteor update</code> was run from an app directory) update the packages used by the current app to the latest versions that are compatible with all other packages used by the app.": "インストールされたMeteorを最新のバージョンにします。さらに、コマンドがアプリのディレクトリから実行された場合には、そのアプリで使用しているパッケージのバージョンを互換性を保てる範囲でアップデートします。",
    "Add a package (or multiple packages) to your Meteor project. To query for available packages, use the <code>meteor search</code> command.": "パッケージをMeteorアプリに追加します。使えるパッケージを検索するには、<code>meteor search</code>コマンドを使います。",
    "Remove a package previously added to your Meteor project. For a list of the packages that your application is currently using, use the <code>meteor list</code> command.": "以前Meteorアプリに追加されたパッケージを削除します。現在使っているパッケージの一覧を表示するには、<code>meteor list</code>コマンドを使います。",
    "Opens a MongoDB shell for viewing and/or manipulating collections stored in the database. Note that you must already be running a server for the current app (in another terminal window) in order for <code>meteor mongo</code> to connect to the app&apos;s database.": "データベースに格納されているコレクションを閲覧もしくは操作するためのMongoDBシェルを開きます。<code>meteor mongo</code>でアプリのデータベースに接続するためには、あらかじめ(別のターミナルで)アプリを起動しておく必要があります。",
    "Reset the current project to a fresh state. Removes all local data.": "現在のアプリを完全に新しい状態にします。すべてのローカルデータが削除されます。",
    "If you use <code>meteor reset</code> often, but you have some initial data that you don&apos;t want to discard, consider using <a href=\"#/basic/Meteor-startup\"><code>Meteor.startup</code></a> to recreate that data the first time the server starts up:": "<code>meteor reset</code>をよく使う場合で、初期データを入れたい場合は、<a href=\"#/basic/Meteor-startup\"><code>Meteor.startup</code></a>を使って次のようにサーバ起動時にデータを再生成するようにできます。"
}
