{
    "Specify template helpers available to this template.": "このテンプレート用のテンプレートヘルパーを指定する。",
    "Dictionary of helper functions by name.": "名前とヘルパー関数の辞書",
    "Here&apos;s how you might define a helper called <code>name</code> for a template called <code>nametag</code> (in JavaScript):": "下記の例は、<code>nametag</code>というテンプレートに<code>name</code>とうヘルパー関数を定義するものです。(JavaScriptで)",
    "And here is the <code>nametag</code> template itself (in HTML):": "そしてこちらが<code>nametag</code>テンプレートそのものです。(HTMLで)",
    "Spacebars also has a few other handy control structures that can be used to make your views more dynamic:": "Spacebarsには他にもビューを動的にする便利な制御構造が用意されています。",
    "Each nested <code>#each</code> or <code>#with</code> block has its own <em>data context</em>, which is an object whose properties can be used as helpers inside the block. For <code>#with</code> blocks, the data context is simply the value that appears after the <code>#with</code> and before the <code>}}</code> characters. For <code>#each</code> blocks, each element of the given array becomes the data context while the block is evaluated for that element.": "<code>#each</code>や<code>#with</code>で囲まれたブロックは独自の<em>data context</em>を持ち、そのプロパティをブロック内で使うことができます。<code>#with</code>ブロックの場合は、<code>#with</code>と<code>}}</code>の間にある値が単にデータコンテキストになります。<code>#each</code>ブロックの場合は、与えられた配列のそれぞれの要素が、そのブロックを評価する際のデータコンテキストになります。",
    "For instance, if the <code>people</code> helper has the following value": "例えば、<code>people</code>ヘルパーが次のような値を持つ場合",
    "then you can display every person&apos;s name as a list of <code>&lt;p&gt;</code> tags:": "この場合は次のようにしてすべての人の名前を<code>&lt;p&gt;</code>タグのリストで表示することができます:",
    "or use the &quot;nametag&quot; template from above instead of <code>&lt;p&gt;</code> tags:": "もしくは<code>&lt;p&gt;</code>タグの代わりに上記の&quot;nametag&quot;テンプレートを使うこともできます:",
    "Remember that helpers can be functions as well as simple values. For example, to show the logged in user&apos;s username, you might define a function-valued helper called <code>username</code>:": "ヘルパーは単純な値だけでなく関数を指定することもできます。例えば、ログインユーザのユーザ名を表示するには、<code>username</code>というヘルパーに関数を指定することができます:",
    "Now, each time you use the <code>username</code> helper, the helper function above will be called to determine the user&apos;s name:": "このとき、<code>username</code>ヘルパーを使う度に、上記のヘルパー関数が呼び出されユーザ名を決定することになります:",
    "Helpers can also take arguments. For example, here&apos;s a helper that pluralizes a word:": "ヘルパー関数は引数をとることもできます。例えば、下記は単語を複数形にする関数です:",
    "Pass in arguments by putting them inside the curly braces after the name of the helper:": "引数は{{}}ブロック内のヘルパー名の後に指定します:",
    "The helpers above have all been associated with specific templates, but you can also make a helper available in all templates by using <a href=\"#template_registerhelper\"><code>Template.registerHelper</code></a>.": "上記のヘルパーはすべて特定のテンプレートに関連づけられていましたが、すべてのテンプレートで使えるヘルパーを作ることもできます。これには、<a href=\"#template_registerhelper\"><code>Template.registerHelper</code></a>を使います。",
    "You can find detailed documentation for Spacebars in the <a href=\"https://github.com/meteor/meteor/blob/master/packages/spacebars/README.md\">README on GitHub</a>. Later in this documentation, the sections about <code>Session</code>, <code>Tracker</code>, <code>Collections</code>, and <code>Accounts</code> will talk more about how to add dynamic data to your templates.": "Spacebarsに関する詳細ドキュメントは<a href=\"https://github.com/meteor/meteor/blob/master/packages/spacebars/README.md\">README on GitHub</a>にあります。本ドキュメント後半では、<code>Session</code>や<code>Tracker</code>や<code>Collections</code>や<code>Accounts</code>の説明があり、テンプレートに動的にデータを渡す方法についてさらに解説します。"
}
