{
    "Your JavaScript code can run in two environments: the <em>client</em> (browser), and the <em>server</em> (a <a href=\"http://nodejs.org/\">Node.js</a> container on a server).  For each function in this API reference, we&apos;ll indicate if the function is available just on the client, just on the server, or <em>Anywhere</em>.": "JavaScriptコードは2つの環境で動きます。一つは<em>client</em>すなわちブラウザです。もう一つは、<em>server</em>すなわちサーバ上の<a href=\"http://nodejs.org/\">Node.js</a>の中です。このAPI仕様書ではそれぞれの関数がどちらで動くものか明記されます。クライアントとサーバの両方で動く場合は<em>Anywhere</em>と示されます。",
    "In Meteor, views are defined in <em>templates</em>. A template is a snippet of HTML that can include dynamic data. You can also interact with your templates from JavaScript code to insert data and listen to events.": "Meteorではビューは<em>templates</em>内に定義されます。一つのテンプレートは動的なデータを含むことのできるHTMLのスニペットです。テンプレートにはJavaScriptコードからアクセスでき、データを挿入したりイベントを待ち受けたりできます。",
    "Templates are defined in <code>.html</code> files that can be located anywhere in your Meteor project folder except the <code>server</code>, <code>public</code>, and <code>private</code> directories.": "テンプレートは<code>.html</code>ファイルに定義されます。ファイルは複数でもよくMeteorプロジェクトディレクトリのどこにあっても構いません。ただし、次の3つのディレクトリは除きます。<code>server</code>と<code>public</code>と<code>private</code>。",
    "Each <code>.html</code> file can contain any number of the following top-level elements: <code>&lt;head&gt;</code>, <code>&lt;body&gt;</code>, or <code>&lt;template&gt;</code>. Code in the <code>&lt;head&gt;</code> and <code>&lt;body&gt;</code> tags is appended to that section of the HTML page, and code inside <code>&lt;template&gt;</code> tags can be included using <code>{{&gt; templateName}}</code>, as shown in the example below. Templates can be included more than once &#x2014; one of the main purposes of templates is to avoid writing the same HTML multiple times by hand.": "<code>.html</code>ファイルには次のトップレベル要素をいくつでも含むことができます。<code>&lt;head&gt;</code>や<code>&lt;body&gt;</code>や<code>&lt;template&gt;</code>。<code>&lt;head&gt;</code>と<code>&lt;body&gt;</code>タグのコードはすべて連結されHTMLページの所定の位置に入れられます。<code>&lt;template&gt;</code>タグのコードは<code>{{&gt; templateName}}</code>を使ってインクルードすることができます。次の例を参照してください。テンプレートは複数回インクルードすることができます。テンプレートは同じHTMLを複数回記述しなくすむためのものです。",
    "The <code>{{ ... }}</code> syntax is part of a language called Spacebars that Meteor uses to add functionality to HTML. As shown above, it lets you include templates in other parts of your page. Using Spacebars, you can also display data obtained from <em>helpers</em>. Helpers are written in JavaScript, and can be either simple values or functions.": "<code>{{ ... }}</code>という文法はMeteorがHTMLを拡張するためのSpacebarsという言語の一部です。上記の例ように、テンプレートをページの任意の位置にインクルードすることができます。Spacebarsを使うと<em>helpers</em>からのデータを表示することもできます。ヘルパーはJavaScriptで記述し、単なる値もしくは関数で書きます。"
    }
