{
    "To get accounts functionality, add one or more of the following packages to your app with <code>meteor add</code>:": "アカウント機能を使うには、下記のパッケージをひとつ以上追加する必要があります。<code>meteor add</code>コマンドを使います:",
    "Include the <code>loginButtons</code> template somewhere in your HTML to use Meteor&apos;s default UI for logging in. To use this, you need to add the <code>accounts-ui</code> package, in your terminal:": "<code>loginButtons</code>のテンプレートをHTMLのどこかに設置すると、MeteorのデフォルトのログインUIが使えます。これを使うには、次のように<code>accounts-ui</code>パッケージを追加する必要があります:",
    "Get the current user record, or <code>null</code> if no user is logged in. A reactive data source.": "現在ログイン中のユーザデータを返します。ログインしていない場合は、<code>null</code>が返ります。これはリアクティブデータです。",
    "Get the logged in user from the <a href=\"#meteor_users\"><code>Meteor.users</code></a> collection. Equivalent to <code>Meteor.users.findOne(Meteor.userId())</code>.": "<a href=\"#meteor_users\"><code>Meteor.users</code></a>コレクションからログインユーザのデータを取得します。<code>Meteor.users.findOne(Meteor.userId())</code>と同等です。",
    "Get the current user id, or <code>null</code> if no user is logged in. A reactive data source.": "現在ログイン中のユーザIDを返します。ログインしていない場合は、<code>null</code>が返ります。これはリアクティブデータです。",
    "A <a href=\"#collections\">Mongo.Collection</a> containing user documents.": "すべてのユーザデータを含む<a href=\"#collections\">Mongo.Collection</a>です。",
    "This collection contains one document per registered user. Here&apos;s an example user document:": "このコレクションは一人のユーザにつき一つのドキュメント(データ)を持ちます。下記がユーザドキュメントの一例です:",
    "A user document can contain any data you want to store about a user. Meteor treats the following fields specially:": "ユーザドキュメントには開発者が任意のデータを格納することができます。Meteorは下記のフィールドを特殊フィールドとして扱います。:",
    "Like all <a href=\"#collections\">Mongo.Collection</a>s, you can access all documents on the server, but only those specifically published by the server are available on the client.": "他のすべての<a href=\"#collections\">Mongo.Collection</a>と同じように、サーバにおいてはすべてのドキュメントにアクセスできる。しかし、クライアントにおいては明示的にpublishされたものしかアクセスできない。",
    "By default, the current user&apos;s <code>username</code>, <code>emails</code> and <code>profile</code> are published to the client. You can publish additional fields for the current user with:": "デフォルトでは、現在のユーザの<code>username</code>と<code>emails</code>と<code>profile</code>はpublishされクライアントからアクセスできる。それ以外のフィールドを現在のユーザにpublishするには次のようにする:",
    "If the autopublish package is installed, information about all users on the system is published to all clients. This includes <code>username</code>, <code>profile</code>, and any fields in <code>services</code> that are meant to be public (eg <code>services.facebook.id</code>, <code>services.twitter.screenName</code>). Additionally, when using autopublish more information is published for the currently logged in user, including access tokens. This allows making API calls directly from the client for services that allow this.": "autopublishパッケージがインストールされている状態ではシステム上のすべてのユーザの情報がすべてのクライアントにpublishされる。これは、<code>username</code>と<code>profile</code>と<code>services</code>内の公開フィールド(例:<code>services.facebook.id</code>と<code>services.twitter.screenName</code>)が含まれる。これに加えて、autopublishパッケージを使った場合は、現在ログインしているユーザにはアクセストークンなどさらに情報がpublishされる。これにより、許可されていれば、クライアントからサービスに直接API呼び出しができるようになる。",
    "Users are by default allowed to specify their own <code>profile</code> field with <a href=\"#accounts_createuser\"><code>Accounts.createUser</code></a> and modify it with <code>Meteor.users.update</code>. To allow users to edit additional fields, use <a href=\"#allow\"><code>Meteor.users.allow</code></a>. To forbid users from making any modifications to their user document:": "デフォルトではユーザは自分で<code>profile</code>フィールドを設定したり修正したりするこができる。設定は<a href=\"#accounts_createuser\"><code>Accounts.createUser</code></a>を使い、修正は<code>Meteor.users.update</code>を使う。ユーザに他のフィールドも追加で編集させるには、<a href=\"#allow\"><code>Meteor.users.allow</code></a>を使う。逆にユーザにドキュメントをまったく修正させないようにするには、次のようにする:",
    "Calls <a href=\"#meteor_user\">Meteor.user()</a>. Use <code>{{#if currentUser}}</code> to check whether the user is logged in.": "<a href=\"#meteor_user\">Meteor.user()</a>を呼び出す。ユーザがログインしていがかだけをチェックする場合は、<code>{{#if currentUser}}</code>を使う。"
}
